# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

In [42]:
import pandas as pd
import numpy as np

In [43]:
df=pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")

display(df)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [44]:
column_names = df.columns

cols=[]
for col in df.columns:
    cols.append(col.lower())
df.columns = cols
df

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [45]:
df.rename(columns=lambda x: x.replace(' ','_'), inplace=True)
df = df.rename(columns={'st':'state'})
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [46]:
def clean(x):
    if x in ['M', 'MALE','Male']:
        return 'M'
    elif x in ['Femal', 'femal','female']:
        return 'F'
    else:
        return 'NaN'

In [47]:
df["gender"] = list(map(clean, df["gender"]))

In [48]:
df[('gender')].unique()

array(['NaN', 'M', 'F'], dtype=object)

In [49]:
#use the map function to apply to all columns

In [50]:
def full(x):
    if x=="AZ":
        df.rename(columns = {"AZ":"Arizona"})
    elif x == "Cali":
        df.rename(columns = {"Cali":"California"})
    elif x == "WA":
        df.rename(columns = {"WA":"Washington"})
    else:
        return x
df["state"] = list(map(full,df["state"]))

In [51]:
df["education"] = df["education"].str.replace("Bachelors","Bachelor")
df["customer_lifetime_value"] = df["customer_lifetime_value"].str.replace("%","")

df["vehicle_class"] = df["vehicle_class"].str.replace("Luxury SUV","Luxury")
df["vehicle_class"] = df["vehicle_class"].str.replace("Sports Car","Luxury")
df["vehicle_class"] = df["vehicle_class"].str.replace("Luxury Car","Luxury")

In [52]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,NaN,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,NaN,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [53]:
df[('education')].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [54]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [55]:
df['customer_lifetime_value'] =  pd.to_numeric(df['customer_lifetime_value'], errors='coerce')

In [56]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [57]:
df[('number_of_open_complaints')].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [58]:
df[['value1', 'value2', 'value3']] = df['number_of_open_complaints'].str.split('/', expand=True)

In [59]:
df['value2'] =  pd.to_numeric(df['value2'], errors='coerce')

In [60]:
df = df.rename(columns={'value2':'open_complaints'})

In [61]:
df= df.drop(['number_of_open_complaints'],axis=1)
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,value1,open_complaints,value3
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934,1,0.0,00
1,QZ44356,Arizona,NaN,Bachelor,697953.59,0.0,94.0,Personal Auto,Four-Door Car,1131.464935,1,0.0,00
2,AI49188,Nevada,NaN,Bachelor,1288743.17,48767.0,108.0,Personal Auto,Two-Door Car,566.472247,1,0.0,00
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,Corporate Auto,SUV,529.881344,1,0.0,00
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,Personal Auto,Four-Door Car,17.269323,1,0.0,00

In [62]:
df.dtypes

customer                    object
state                       object
gender                      object
education                   object
customer_lifetime_value    float64
income                     float64
monthly_premium_auto       float64
policy_type                 object
vehicle_class               object
total_claim_amount         float64
value1                      object
open_complaints            float64
value3                      object
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [63]:
numerical_columns=df._get_numeric_data()

In [64]:
numerical_columns

,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,open_complaints
0,NaN,0.0,1000.0,2.704934,0.0
1,697953.59,0.0,94.0,1131.464935,0.0
2,1288743.17,48767.0,108.0,566.472247,0.0
3,764586.18,0.0,106.0,529.881344,0.0
4,536307.65,36357.0,68.0,17.269323,0.0
...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN

In [65]:
df.shape

(4008, 13)

In [66]:
df = df.drop_duplicates()
#we are assuming that the duplicate rows droped are those with the NaN values throughtout all columns.

In [67]:
df.shape

(1072, 13)

In [68]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,value1,open_complaints,value3
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934,1,0.0,00
1,QZ44356,Arizona,NaN,Bachelor,697953.59,0.0,94.0,Personal Auto,Four-Door Car,1131.464935,1,0.0,00
2,AI49188,Nevada,NaN,Bachelor,1288743.17,48767.0,108.0,Personal Auto,Two-Door Car,566.472247,1,0.0,00
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,Corporate Auto,SUV,529.881344,1,0.0,00
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,Personal Auto,Four-Door Car,17.269323,1,0.0,00

In [69]:
df.isna().sum()

customer                     1
state                      176
gender                       0
education                    1
customer_lifetime_value      4
income                       1
monthly_premium_auto         1
policy_type                  1
vehicle_class                1
total_claim_amount           1
value1                       1
open_complaints              1
value3                       1
dtype: int64

In [70]:
df.isnull()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,value1,open_complaints,value3
0,False,False,False,False,True,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1067,False,True,False,False,False,False,False,False,False,False,False,False,False
1068,False,False,False,False,False,False,False,False,False,False,False,False,False
1069,False,False,False,False,False,False,False,False,False,False,False,False,False
1070,False,False,False,False,False,False,False,False,False,False,False,False,False
1071,True,True,False,True,True,True,True,True,True,True,True,True,True

In [71]:
mean_customer_lifetime_value = df['customer_lifetime_value'].mean()
mean_customer_lifetime_value
df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(mean_customer_lifetime_value)

In [72]:
df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,value1,open_complaints,value3
0,RB50392,Washington,NaN,Master,7.936903e+05,0.0,1000.0,Personal Auto,Four-Door Car,2.704934,1,0.0,00
1,QZ44356,Arizona,NaN,Bachelor,6.979536e+05,0.0,94.0,Personal Auto,Four-Door Car,1131.464935,1,0.0,00
2,AI49188,Nevada,NaN,Bachelor,1.288743e+06,48767.0,108.0,Personal Auto,Two-Door Car,566.472247,1,0.0,00
3,WW63253,California,M,Bachelor,7.645862e+05,0.0,106.0,Corporate Auto,SUV,529.881344,1,0.0,00
4,GA49547,Washington,M,High School or Below,5.363077e+05,36357.0,68.0,Personal Auto,Four-Door Car,17.269323,1,0.0,00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1067,VJ51327,None,NaN,High School or Below,2.031500e+06,63209.0,102.0,Personal Auto,SUV,207.320041,1,2.0,00
1068,GS98873,Arizona,NaN,Bachelor,3.239125e+05,16061.0,88.0,Personal Auto,Four-Door Car,633.600000,1,0.0,00
1069,CW49887,California,NaN,Master,4.626801e+05,79487.0,114.0,Special Auto,SUV,547.200000,1,0.0,00
1070,MY31220,California,NaN,College,8.997040e+05,54230.0,112.0,Personal Auto,Two-Door Car,537.600000,1,0.0,00
1071,NaN,NaN,NaN,NaN,7.936903e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [73]:
df.isna().sum()

customer                     1
state                      176
gender                       0
education                    1
customer_lifetime_value      0
income                       1
monthly_premium_auto         1
policy_type                  1
vehicle_class                1
total_claim_amount           1
value1                       1
open_complaints              1
value3                       1
dtype: int64

In [74]:
df.drop([1071],axis=0,inplace=True)
df.isna().sum()

customer                     0
state                      175
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
policy_type                  0
vehicle_class                0
total_claim_amount           0
value1                       0
open_complaints              0
value3                       0
dtype: int64

In [75]:
df['state'].value_counts(dropna=False) #shows all 'None'

state
Oregon        320
California    211
Arizona       186
None          175
Nevada         98
Washington     81
Name: count, dtype: int64

In [76]:
df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'policy_type', 'vehicle_class',
       'total_claim_amount', 'value1', 'open_complaints', 'value3'],
      dtype='object')

In [77]:
df['state']=df['state'].fillna('Oregon')

In [78]:
df['state'].value_counts(dropna=False) #recheck state column

state
Oregon        495
California    211
Arizona       186
Nevada         98
Washington     81
Name: count, dtype: int64

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [79]:
# this was dealt with in the previous exercise

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [80]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [81]:
# Your code here

###__________Start Lab | Customer Analysis Round 3_____from here_____________________________________________________

Show DataFrame info.
Describe DataFrame.
Show a plot of the Gender breakdown.
Show a plot of Income by State.
Show a plot of the Policy Type by the Total Claim Amount.
Show a plot of the Education by Vehicle Class.
What insights can you establish from these plots?
What other plots do you feel would be beneficial?